# В Python есть набор встроенных методов, которые вы можете использовать при работе с list.

#Метод	                    Значение
#append()	#Добавляет элементы в конец списка
#clear()	    #Удаляет все элементы в списке
#copy()	    #Возвращает копию списка
#count()	    #Возвращает число элементов с определенным значением
#extend()    #Добавляет элементы списка в конец текущего списка
#index()	    #Возвращает индекс первого элемента с определенным значением
#insert()	#Добавляет элемент в определенную позицию
#pop()	    #Удаляет элемент по индексу
#remove()	#Убирает элементы по значению
#reverse()	#Разворачивает порядок в списке
#sort()	    #Сортирует список